In [1]:
import numpy as np
import pandas as pd

In [2]:
my_data = ['arsenal','aston villa','Burnley']
arr = np.array(my_data)
values = ['1','2','3']
d = {'a':1, 'b':2, 'c':3}

In [9]:
print(pd.Series(my_data,values))

1        arsenal
2    aston villa
3        Burnley
dtype: object

In [10]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [13]:
#Series can hold up everything
s1 = pd.Series(['1','2','3','4'],['Szceszny', 'Diaby', 'Sagna', 'Holding'])
s1

Szceszny    1
Diaby       2
Sagna       3
Holding     4
dtype: object

In [14]:
s2 = pd.Series(['1','2','4','5'],['Szceszny', 'Diaby', 'Holding', 'Sokratis'])
s2

Szceszny    1
Diaby       2
Holding     4
Sokratis    5
dtype: object

In [15]:
s1+s2

Diaby        22
Holding      44
Sagna       NaN
Sokratis    NaN
Szceszny     11
dtype: object

###DATAFRAMES

In [26]:
from numpy.random import randn
from numpy import random
import random

In [30]:
np.random.seed(101)

In [37]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['z','x','y','w'])

In [38]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [47]:
df[['w','z']]

          w         z
A -1.159119  0.302665
B  0.184502 -0.134841
C  0.329646  0.807706
D  0.484752 -0.497104
E  1.996652 -0.116773

In [48]:
type(df)

pandas.core.frame.DataFrame

In [55]:
type(df['x'])

pandas.core.series.Series

In [56]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [58]:
df['New'] = df['x']

In [60]:
df

          z         x         y         w       New
A  0.302665  1.693723 -1.706086 -1.159119  1.693723
B -0.134841  0.390528  0.166905  0.184502  0.390528
C  0.807706  0.072960  0.638787  0.329646  0.072960
D -0.497104 -0.754070 -0.943406  0.484752 -0.754070
E -0.116773  1.901755  0.238127  1.996652  1.901755

In [65]:
df.drop('New',axis=1, inplace=True)

In [66]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [68]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [71]:
df.shape

(5, 4)

In [84]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [82]:
df.loc[['A','B','C'],['x','w']]

          x         w
A  1.693723 -1.159119
B  0.390528  0.184502
C  0.072960  0.329646

In [83]:
df.iloc[0]

z    0.302665
x    1.693723
y   -1.706086
w   -1.159119
Name: A, dtype: float64

In [85]:
df.loc[['B'],['y']]

          y
B  0.166905

In [86]:
##dataframe part 2

In [87]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [93]:
df['w']>0

A    False
B     True
C     True
D     True
E     True
Name: w, dtype: bool

In [96]:
df[df['x']>0]['w']

A   -1.159119
B    0.184502
C    0.329646
E    1.996652
Name: w, dtype: float64

In [107]:
df['w']

A   -1.159119
B    0.184502
C    0.329646
D    0.484752
E    1.996652
Name: w, dtype: float64

In [108]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [122]:
df[(df['x']<0) & (df['w']>0)]

          z        x         y         w
D -0.497104 -0.75407 -0.943406  0.484752

In [123]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [124]:
df.reset_index()

  index         z         x         y         w
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [126]:
rewind = 'Ars Chel ManC ManU Eve'.split()

In [127]:
rewind

['Ars', 'Chel', 'ManC', 'ManU', 'Eve']

In [130]:
df['States'] = df['x']

In [133]:
df.drop('States',axis=1, inplace=True)

In [134]:
df

          z         x         y         w
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [135]:
df['States'] = rewind

In [143]:
df.set_index('States')

               z         x         y         w
States
Ars     0.302665  1.693723 -1.706086 -1.159119
Chel   -0.134841  0.390528  0.166905  0.184502
ManC    0.807706  0.072960  0.638787  0.329646
ManU   -0.497104 -0.754070 -0.943406  0.484752
Eve    -0.116773  1.901755  0.238127  1.996652

In [144]:
df

          z         x         y         w States
A  0.302665  1.693723 -1.706086 -1.159119    Ars
B -0.134841  0.390528  0.166905  0.184502   Chel
C  0.807706  0.072960  0.638787  0.329646   ManC
D -0.497104 -0.754070 -0.943406  0.484752   ManU
E -0.116773  1.901755  0.238127  1.996652    Eve

In [145]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [146]:
df = pd.DataFrame(d)

In [147]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [148]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [149]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [150]:
df.fillna(value= 'Fill')

      A     B  C
0     1     5  1
1     2  Fill  2
2  Fill  Fill  3

In [151]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [154]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [155]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [164]:
df.dropna(thresh = 1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [168]:
d = { 'A':['foo','foo','bar','bar'],
      'B':['One','Two','One','Two'],
      'C':['x','y','x','y'], 'D':[1,3,4,5]}

In [171]:
df = pd.DataFrame(d)
df

     A    B  C  D
0  foo  One  x  1
1  foo  Two  y  3
2  bar  One  x  4
3  bar  Two  y  5

In [176]:
df['D'].nunique()

4

In [177]:
df['D'].value_counts()

5    1
4    1
3    1
1    1
Name: D, dtype: int64

In [178]:
df

     A    B  C  D
0  foo  One  x  1
1  foo  Two  y  3
2  bar  One  x  4
3  bar  Two  y  5

In [180]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [182]:
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [184]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [188]:
df.pivot_table(values='D', index =['A','B'] ,columns ='C' )

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [186]:
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

In [189]:
import pandas as pd

In [191]:
pwd

'C:\\Users\\dude_\\Desktop\\Python Anaconda Example\\Machine Learning Bootcamp\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [200]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15